app/controllers/songs_controller.rb

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 1]]
SELECT COUNT(*) FROM "artists" WHERE "artists"."id" = ?  [["id", 999]]
SELECT "songs".* FROM "songs" WHERE "songs"."artist_id" = ?  [["artist_id", 1]]
---
  def index
    if params[:artist_id]
      if !Artist.where(id: params[:artist_id]).empty?
        @artist = Artist.find(params[:artist_id])
        @songs = @artist.songs
      else
        flash[:alert] = "Artist not found"
        redirect_to artists_path
      end
    else
      @songs = Song.all

SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 1]]
SELECT COUNT(*) FROM "songs" WHERE "songs"."id" = ?  [["id", 66]]
---
  def show
    if Song.where(id: params[:id]).empty?